title: Log4Shell Initial Scheduled Tasks
id:  
status: experimental
description: 
references:
- https://www.cisa.gov/uscert/ncas/analysis-reports/ar22-203a
author: Cyber Panda
date: 2023/01/11
tags:
- attack.command_and_control
logsource:
category: process_creation
product: windows
detection:
selection:
CommandLine|contains|all:
- schtasks
- create
CommandLine|contains:
- .ps1
- .zip
- nmap
condition: selection
fields:
- CommandLine
- ParentCommandLine
falsepositives:
- 
level: medium
