title: "Certutil Abuse"
id: 
description: "Certutil Abuse"
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/certutil 
- https://www.varonis.com/blog/the-malware-hiding-in-your-windows-system32-folder-part-iii-certutil-and-alternate-data-streams 
author: Cyber Panda
date: 2023/01/15
tags:
- attack.initial_access
- attack.defense_evasion
status: "experimental"
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|contains: ‘certutil’
   selection2:
    CommandLine|contains:
    - ‘urlcache’
    - ‘encode’
    - ‘decode’
    - ‘decodehex’
  condition: selection and selection2
fields:
- ""
falsepositives:
- None known
level: "medium"
